{
  "_name_or_path": "/Users/connorsecrist/Dyslexia/ml/quick_correction/models/quick_correction_base_v1/",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-ERROR",
    "2": "I-ERROR"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-ERROR": 1,
    "I-ERROR": 2,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "vocab_size": 30522
}
